In [39]:
# !pip install ipython-sql

In [1]:
import config as cfg

#### Connect to the Postgres server

In [2]:
%load_ext sql
conn_string = "postgresql://{}:{}@127.0.0.1:5432/airline".format(cfg.user, cfg.password)
%sql $conn_string

## 1. Which day had the most flights?

In [3]:
%%sql
SELECT flight_date, COUNT(flight_id) as count
FROM airline_fact
GROUP BY flight_date
ORDER BY count desc
limit 5;

 * postgresql://thesis:***@127.0.0.1:5432/airline
5 rows affected.

[(datetime.date(2020, 3, 12), 23628),
 (datetime.date(2020, 3, 13), 23486),
 (datetime.date(2020, 3, 9), 23362),
 (datetime.date(2020, 3, 16), 23357),
 (datetime.date(2020, 3, 6), 23245)]

## 2. How many planes do airlines have?

In [4]:
%%sql 
SELECT af.c_airline, ad.airline_name, count(distinct af.c_aircraft)
FROM airline_fact af
JOIN airline_dim ad
    ON af.c_airline = ad.c_airline
GROUP BY af.c_airline, ad.airline_name
ORDER BY count desc;

 * postgresql://thesis:***@127.0.0.1:5432/airline
10 rows affected.

[('AA', 'American Airlines', 1566),
 ('UA', 'United Airlines', 1427),
 ('DL', 'Delta Air Lines', 1336),
 ('WN', 'Southwest Airlines', 708),
 ('AS', 'Alaska Airlines', 329),
 ('B6', 'JetBlue', 304),
 ('NK', 'Spirit Airlines', 154),
 ('F9', 'Frontier Airlines', 100),
 ('G4', 'Allegiant Air', 97),
 ('HA', 'Hawaiian Airlines', 65)]

## 3. How many flights did the airlines make?

In [5]:
%%sql 
SELECT af.c_airline, ad.airline_name, count(af.flight_num)
FROM airline_fact af
JOIN airline_dim ad
    ON af.c_airline = ad.c_airline
GROUP BY af.c_airline, ad.airline_name
ORDER BY count desc;

 * postgresql://thesis:***@127.0.0.1:5432/airline
10 rows affected.

[('AA', 'American Airlines', 655371),
 ('DL', 'Delta Air Lines', 508497),
 ('WN', 'Southwest Airlines', 456578),
 ('UA', 'United Airlines', 448941),
 ('AS', 'Alaska Airlines', 136126),
 ('B6', 'JetBlue', 81547),
 ('NK', 'Spirit Airlines', 63093),
 ('F9', 'Frontier Airlines', 42773),
 ('G4', 'Allegiant Air', 39211),
 ('HA', 'Hawaiian Airlines', 26376)]

## 4. List 5 states that have a large number of airports

In [6]:
%%sql
SELECT  state.c_state, 
        state.state_name, 
        count(distinct city_name) as city_count,
        count(distinct port.c_port) as port_count
FROM port_loc_dim port
JOIN state_dim state
    ON state.c_state = port.c_state
GROUP BY state.c_state, state.state_name
ORDER BY port_count desc
limit 5;

 * postgresql://thesis:***@127.0.0.1:5432/airline
5 rows affected.

[('TX', 'Texas', 24, 25),
 ('CA', 'California', 22, 22),
 ('AK', 'Alaska', 20, 20),
 ('FL', 'Florida', 19, 19),
 ('NY', 'New York', 15, 16)]

## 5. How many canceled flights did it have?

In [7]:
%%sql
SELECT count(c_cancel) as total_cancellation
FROM airline_fact
WHERE c_cancel != 'O';

 * postgresql://thesis:***@127.0.0.1:5432/airline
1 rows affected.

[(0,)]

## 6. How many flights were delayed on departure and arrival with a delay of more than 30 minutes?

In [13]:
%%sql
SELECT  count(dep_delay_group) as total_dep_delay,
        count(arr_delay_group) as total_arr_delay
FROM airline_fact
WHERE dep_delay_group > '2' and arr_delay_group > '2';

 * postgresql://thesis:***@127.0.0.1:5432/airline
1 rows affected.

[(260361, 260361)]